[{"title":"慢慢我们便习惯了别离","date":"2017-04-03T17:10:08.000Z","path":"2017/04/04/慢慢我们便习惯了别离/","text":"又是一年三月初八。 入夜后，小院内独自踱步，没有香径，不见燕归来。许久未回家，发觉家中的桂花已吐出来不少的嫩芽，绿了樱桃树，黄了油菜花。顿时思绪涌起，愁思满怀。流年似水，岁月蹉跎，不知不觉的便遗忘了许多。曾经那些熟悉的容颜，似乎也都在岁月的风声里越去越远了，只余下一些记忆的痕迹，散落成一地的斑驳，再也找不回昨日的似锦繁华。 春又来 人已去 风烟残 夕阳晚樱花开 顷刻散 零乱年光逝 韶华落 飞絮转 不堪看路漫漫 空梦断 零乱渡忘川 彼岸 忘不掉 人常叹古井下 月光思念装满樱花瓣 飘过 风幽怨 水清寒离伤黯 游丝转 零乱 人生最不愿面对的便是别离，但我们又不得不面对别离，为了理想远别亲友漂泊他乡，为了事业拒绝舒适加班天亮，为了生活放弃爱好从事他行……慢慢，告别成了人生的常态。随着成长，我们看惯了花开花落，潮涨潮汐，对别离也就不再那么敏感……后来，我们明白，告别的经验虽然有它的酸苦，但是也在丰富着我们的生活，也让我们活一天，好好地过一天。塞翁失马，永远不知道意味着什么？人生是值得珍贵的。 正如王蒙说：告别对一个人并没有那么的痛苦，因为只要是活着的时候的告别，都意味着新的开始，新的地区、新的时间、新的岗位、新的平台。就看你有多大的勇气。 很喜欢他在《明年我将衰老》中写下的： 我用俄语唱遥远， 用英语唱情怀， 用维吾尔语唱眼睛， 用不言不语唱景仰墓园。 而我告诉自己：我要用不言不语唱等待。在没有尽头的孤独的路上等待翻山越岭的另一边的一个思念。正说王蒙说：时间在等待相遇与相识，时间在等待知己与挚爱，等待抚摸与亲吻，时间在等待迷恋与融化，在等待阴阳二电激荡出雷鸣电闪。 new APlayer({ element: document.getElementById(\"aplayer0\"), narrow: false, autoplay: true, showlrc: 0, music: { title: \"当你老了\", author: \"dnll_zz.mp3\", url: \"wlr.jpg\", pic: \"\", } }); 但还有一种告别，它是可能无法再开始了。 欢迎总是带着微笑， 告别却伴随着一声叹息， 看来也不尽然， 既然是不可避免地要和告别面对， 那我们应该选择充满勇气地去面对。 饭后茶余，仍旧徘徊，天气也是很应景的落下了这个节气的纷纷细雨。一阵凉意惊走我的幽幽愁意。沉思告别的思绪也该和我告别了，我该说些什么呢？我想我还是借用王蒙先生的诗句来做一个结束吧， 让我永远想念你们， 招呼你们并且怀着骄傲， 注视着你们。 iGhibli丁酉鸡年清明节于家中","tags":[{"name":"随笔","slug":"随笔","permalink":"https://github.com/iGhibli/tags/随笔/"}]},{"title":"Hello World","date":"2017-03-30T14:23:39.000Z","path":"2017/03/30/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]},{"title":"Could not locate device support files","date":"2017-03-28T02:10:10.000Z","path":"2017/03/28/Could-not-locate-device-support-files/","text":"每次iOS更新推送，我们会发现更新后的手机无法进行真机调试了。Apple历来如此，随着iOS的版本更新，Xcode也会更新新版。新版的Xcode里包含着对新的iOS版本的支持SDK文件。所以说更新到最新版的Xcode就可以解决这个问题了，但更新过Xcode的人都知道那种煎熬，快则一两个小时，慢的可能要熬夜更新了。不过还是有个更简便快捷的方法解决这个问题的，下来就来分享下： 错误信息： Could not locate device support files Could not find Developer Disk Image 解决办法： 打开Finder 打开应用程序文件夹 在里面找到Xcode应用 点击Xcode，右键 -&gt; 显示包内容 在里面按下面目录层级找到支持的真机测试文件：Contents -&gt; Developer -&gt; Platforms -&gt; iPhoneOS.platform -&gt; DeviceSupport(/Applications/Xcode.app/Contents/Developer/Platforms/iPhoneOS.platform/DeviceSupport) 上面的目录里面就是当前Xcode支持真机调试的真机iOS版本，如下图所示： 然后通过别的渠道拷贝最新的DeviceSupport文件到这个目录里面就可以用最新的iOS设备真机调试了。 是不是很方便，省去了更新Xcode的麻烦。什么？你找不到新的Device Support文件！好吧，你可以通过朋友的最新的Xcode拷贝出来，或者下载我的分享。😜 分享链接： GitHub 百度云 Xcode各版本官网下载地址 随记12345678910111213141516171819202122232425262728293031每天站在高楼上看着地上的小蚂蚁他们的头很大他们的腿很细他们拿着苹果手机他们穿着耐克阿迪上班就要迟到了他们很着急慌慌张张 匆匆忙忙为何生活总是这样难道说 我的理想就是这样渡过一生的时光不卑不亢 不慌不忙也许生活应该这样难道说 60岁以后再去寻找我想要的自由一年一年飞逝而去还是那一点点小积蓄我喜欢的好多东西还是买不起生活总是麻烦不断到现 在我还没习惯都说钱是王八蛋可长得真好看其实我也常跟自己说人要学会知足而常乐可万事都一笑而过还有什么意思呢 郝云这是唱的我吗？🤔真的好像！😔 ~~(&gt;_&lt;)~~ 哈哈… 慌慌张张、匆匆忙忙、一早刚赶到公司开完会，拿出我的苹果手机。咦！设置应用怎么又有小红点，对于有强迫症的我怎么能忍，赶紧打开设置看了一下，原来iOS又更新了，还是大版本更新吔！但一想到更新之后真机调试怎么办？还是咽了口吐沫，一咬牙忍了。😂过了会朋友告诉我这次iOS更新更换了文件的格式，更新后手机多出了2G多的空间。好心动的更新啊，于是就又翻了翻更新内容详情，好诱人哦，怎么办？不能忍啊…唉，果断连上Mac更新啊！更新后真的多出了2G的空间，好兴奋！可悲催的还在后边，更新前清楚的知道无法真机调试了，虽说可以从别人更新的Xcode中提取出来支持文件，但尝鲜太快了，朋友们都没更新。哎！只能自己先更新了，更新了三四个小时啊！等的好心急，又浪费了一上午的大好时光。为了不让大家再遇到这种尴尬，节约大家时间，现在共享给大家。大家可以直接在上面的链接下载到我整理的最新的Device Support。 end 转载请注明出处: https://ighibli.github.io/2017/03/28/Could-not-locate-device-support-files/。如果觉得我的文章对您有用，请随意打赏。您的支持将鼓励我加倍努力！谢谢！","tags":[{"name":"iOS开发","slug":"iOS开发","permalink":"https://github.com/iGhibli/tags/iOS开发/"}]},{"title":"Hello,iGhibli!","date":"2015-10-10T02:10:10.000Z","path":"2015/10/10/Hello-iGhibli/","text":"Hi,I’m iGhibli!I was a young writer and I wanted to take off. Somewhere along the line I knew there’d be girls, visions, everything; somewhere along the line the pearl would be handed to me.","tags":[]}]